"CIAdditionCompositing" = "添加颜色成份以获得赏心悦目的效果。该滤镜通常用于添加高亮显示和镜头眩光效果。";"CIAffineClamp" = "在来源图像上执行仿射变换，然后箝位变换后图像边缘的像素，向外扩展它们。该滤镜的执行方式与 CIAffineTransform 滤镜相似，除了它产生的是无限范围的图像外。当您需要模糊化图像，而又要避免边缘出现柔软、黑暗的须边时，您可以使用该滤镜。";"CIAffineTile" = "对图像应用仿射变换，然后拼贴变换后的图像。";"CIAffineTransform" = "对图像应用仿射变换。您可以缩放、转化或旋转输入图像。您还可以应用这些操作的结合。";"CIBarsSwipeTransition" = "通过挥击前景图像的矩形部分以显示目标图像，来完成从一幅图像到另一幅图像的过渡。";"CIBlendWithMask" = "使用灰度蒙版的值，来完成图像和背景间的插入。当遮罩值为 0.0 时，结果是背景。当遮罩值为 1.0 时，结果是图像。";"CIBloom" = "柔化边缘并在图像上应用一个令人愉悦的发光效果。";"CIBoxBlur" = "使用一个方框形的褶积矩阵来平滑化或锐化图像。";"CIBumpDistortion" = "创建一个起源于图像上某个指定点的凹进或凸出。";"CIBumpDistortionLinear" = "创建一个起源于图像线性部分的凸起。";"CICMYKHalftone" = "在纸张上使用青、红、黄、黑墨水，创建来源图像的彩色、半色调的转绘。";"CICheckerboardGenerator" = "生成一个棋盘格图案。您可以指定棋盘格大小、颜色以及图案的清晰度。";"CICircleSplashDistortion" = "扭曲从圆周开始的像素，并向外散发。";"CICircularScreen" = "模拟一个圆形半色调屏幕";"CICircularWrap" = "用图像围绕透明圆形。离圆形的中心越远，图像就越扭曲。";"CIColorControls" = "调整饱和度、亮度和对比度值。";"CIColorCube" = "使用一个三维颜色表来变换来源图像像素。该颜色表必须由使用预乘 alpha 的浮点 RGBA 单元格所组成。单元格以标准顺序排列。数据的列和行分别以红色和绿色来索引。每个数据平面后紧跟着下一个更高数据的平面，这些平面以蓝色作索引。";"CIColorInvert" = "颠倒图像中的颜色。";"CIColorMap" = "使用表格中提供的映射值，以执行来源颜色值的非线性变换。";"CIColorMatrix" = "乘以来源颜色值，并给每个颜色成份添加一个偏移系数。";"CIColorMonochrome" = "重新匹配颜色，使它们落入一个单色的阴影内。";"CIColorPosterize" = "重新匹配红、绿、蓝颜色成份到您指定给每个颜色成份的亮度色阶数。该滤镜将打平颜色，使它们看起来类似被丝绸掩蔽的海报。";"CIComicEffect" = "通过分级显示边缘和应用颜色半色调效果，来模拟连环漫画册图画。";"CIConstantColorGenerator" = "生成单色。您通常使用该滤镜的输出作为另一个滤镜的输入。";"CICopyMachineTransition" = "通过模拟复印机的效果，来完成从一幅图像到另一幅图像的过渡，";"CICrop" = "对图像应用裁剪。裁剪出来的图像的大小和形状，取决于您指定的矩形的大小。";"CICrystallize" = "通过聚集来源像素颜色值，来创建多边形形状的颜色块。";"CIDiscBlur" = "使用一个光盘形的褶积矩阵来平滑化或锐化图像。";"CIDisintegrateWithMaskTransition" = "使用蒙版定义的形状，来完成从一幅图像到另一幅图像的过渡。";"CIDisplacementDistortion" = "将第二幅图像的灰度值应用到第一幅图像。输出图像拥有一个由该灰度值定义的纹理。";"CIDissolveTransition" = "在从一幅图像到另一幅图象的过渡中使用渐隐。";"CIDotScreen" = "模拟半色调屏幕的点图案。";"CIEdges" = "查找图像的所有边缘，然后带颜色显示它们。";"CIEdgeWork" = "生成一幅图像的固定格式的黑白转绘，看起来像木板剪贴画的。";"CIEightfoldReflectedTile" = "应用 8 路反射对称从来源图像生成一个拼贴图案。";"CIExposureAdjust" = "对图像曝光设置的调整，与您更改光圈值以控制照相机曝光类似。";"CIFalseColor" = "映射亮度到由两种颜色组成的颜色斜面。假彩色经常用于处理天文学和其它科学数据，比如紫外线或 X 射线图像。";"CIFastBoxBlur" = "使用一个方框形的褶积矩阵来平滑化或锐化图像。";"CIFastDiscBlur" = "使用一个光盘形的褶积矩阵来平滑化或锐化图像。";"CIFlashTransition" = "创建闪光灯以完成从一幅图像到另一幅图像的过渡。闪光灯起源于您指定的一个点。开始时很小，然后它逐渐扩展，直到以闪光灯颜色填满整个图像框。随着颜色淡去，目标图像开始显示。";"CIFourfoldReflectedTile" = "应用 4 路反射对称从来源图像生成一个拼贴图案。";"CIFourfoldRotatedTile" = "通过以 90 度增量旋转来源，从来源图像产生拼贴图像。";"CIFourfoldTranslatedTile" = "应用 4 路转化操作从来源图像生成一个拼贴图案。";"CIGammaAdjust" = "调整中间色调的亮度。该滤镜通常用于补偿显示的非线性效果。调整灰度系数，将有效更改黑与白之间过渡的倾斜度。";"CIGaussianBlur" = "通过高斯分布指定的值以展开来源像素。";"CIGaussianGradient" = "使用高斯分布生成从一种颜色到另一种颜色的渐变。";"CIGlassDistortion" = "应用一个玻璃状纹理以扭曲图像。输出图像的升起部分是应用纹理贴图的结果。";"CIGlassLozenge" = "创建菱形形状的镜头，并扭曲图像中有镜头置于其上的部分。";"CIGlideReflectedTile" = "通过转化和抹去图像，以从来源图像生成拼贴图像。";"CIGloom" = "使图像的高亮显示变暗。";"CIHatchedScreen" = "模拟半色调屏幕的影线图案。";"CIHeightFieldFromMask" = "从灰度蒙版中创建持续的、三维的、屋顶形状的高度场。蒙版中的白色值定义了高度场内部的像素，黑色值定义了外部的像素。域值在遮罩内平滑和持续的变化，在遮罩边缘该值为 0。您可以将 CIShadedMaterial 滤镜与该滤镜一起使用，以产生非常真实的着色对象。";"CIHexagonalPixellate" = "显示一幅图像作为有色的六边形，其颜色是它们替换了的像素的平均值。";"CIHoleDistortion" = "创建一个将图像像素往外推的圆形区域，该区域对离圆圈最近的像素的扭曲效果最强。";"CIHueAdjust" = "更改来源像素的全部色调和色彩。";"CIKaleidoscope" = "应用 12 路对称从来源图像生成一幅万花筒图像。";"CILanczosScaleTransform" = "创建来源图像的高质量的缩放的版本。该滤镜通常用作按比例缩小图像。";"CILenticularHaloGenerator" = "模拟由衍射所产生的光环，该衍射是与镜头的展开联合的。该滤镜通常应用到另一个图像上以模拟镜头眩光和类似的效果。";"CILineOverlay" = "创建一幅以黑色勾画出的图像边缘的素描，图像中未勾画的部分呈透明状。结果含有 alpha 且以黑色渲染，因此看起来没有多少，直到您使用来源到合成的方式将它渲染到另一幅图像上。";"CILineScreen" = "模拟半色调屏幕的线图案。";"CILinearGradient" = "生成一个渐变，该渐变在一条线性轴上的两个定义的端点之间变化。";"CIMaskToAlpha" = "将灰度图像转换为由 alpha 蒙版的白色图像。来源图像的白色值构成了蒙版的内部；黑色值变成彻底透明。";"CIMaximumCompositing" = "通过颜色成份计算两幅输入图像的最大值，并用最大值创建输出图像。这与遮光类似。";"CIMedianFilter" = "计算一组相邻像素的中值，然后用中值替换每个像素值。效果是消除杂点。";"CIMinimumCompositing" = "通过颜色成份计算两幅输入图像的最小值，并用最小值创建输出图像。这与加深类似。";"CIModTransition" = "通过在不规则形状的孔洞上显示目标图像，来完成从一幅图像到另一幅图像的过渡。";"CIMotionBlur" = "模糊化图像以模拟一种照相机效果，该效果是在使用照相机捕捉图像时通过移动特定的角度和距离而产生。";"CIMultiplyCompositing" = "将两幅输入图像的颜色成份相乘，然后用乘积创建一幅输出图像。该滤镜通常用于给图像添加聚光灯或类似的照明效果。";"CINoiseReduction" = "使用阀值来定义什么样的将被认作杂点，以消除杂点。亮度中低于那个值的小更改被认作是杂点，会被进行杂点消除处理，即本地模糊化。高于该阀值的更改被认作边缘，会被锐化。";"CIOpTile" = "应用任何指定的缩放和旋转来分割图像，然后重新将图像组合起来，以获得欧普视觉艺术效果。";"CIPageCurlTransition" = "通过模拟卷曲的页面（卷曲时显示新图像），来完成从一幅图像到另一幅图像的过渡。";"CIParallelogramTile" = "在平行四边形内反射图像以弯曲它，然后拼贴该结果。";"CIPerspectiveTile" = "对图像应用透视变换，然后拼贴该结果。";"CIPerspectiveTransform" = "修改图像的几何形状，以模拟观察者更改观看位置。您可以使用透视滤镜来倾斜图像。";"CIPinchDistortion" = "创建一个将图像像素向内聚拢的矩形区域，该区域对离矩形最近的像素的聚拢效果最强。";"CIPixellate" = "使图像呈斑驳状。";"CIPointillize" = "以 pointillistic 样式渲染来源图像。";"CIRadialGradient" = "生成一个渐变，该渐变在两个圆心相同的圆之间放射状地变化。两圆的其中一个的半径为 0 是有效的。";"CIRandomGenerator" = "产生一幅无限范围的图像，该图像的像素值由四个独立的、不均匀分布的随机数组成，随机数范围为 0 到 1。";"CIRippleTransition" = "通过创建从中点扩展的波浪（波浪经过时显示新图像），来完成从一幅图像到另一幅图像的过渡。";"CISepiaTone" = "将图像颜色匹配到多种棕色阴影。";"CIShadedMaterial" = "从高度场产生一幅着色图像。高度场被定义为高度值较大则阴影较亮，高度值较小（区域较低）则阴影较暗。您可以将该滤镜与 CIHeightFieldFromMask 滤镜结合，以产生蒙版的快速着色，比如文本。";"CISharpenLuminance" = "通过锐化增加图像细节。它作用于图像的亮度；像素的色度不受影响。";"CISixfoldReflectedTile" = "应用 6 路反射对称从来源图像生成一个拼贴图案。";"CISixfoldRotatedTile" = "通过以 60 度增量旋转来源，从来源图像产生拼贴图像。";"CISourceAtopCompositing" = "将来源图像放置在背景图像上，然后使用背景图像的亮度以决定要显示什么。该合成显示了背景图像，以及仅仅那些在背景可见部分之上的来源图像的部分。";"CISourceInCompositing" = "使用第二幅图像来决定在来源图像中保留什么，通过有效地裁剪图像后。";"CISourceOutCompositing" = "使用第二幅图像来决定从第一幅图像中取出什么。";"CISourceOverCompositing" = "将第二幅图像放置在第一幅图像上。";"CISpotColor" = "用光斑颜色替换一种或多种颜色范围。";"CISpotLight" = "将带方向的聚光灯效果应用到图像。";"CIStarShineGenerator" = "产生星型爆裂图案。该输出图像通常用作另一个滤镜的输入。";"CIStripesGenerator" = "产生一个条纹图案。您可以控制条纹的颜色、间距和对比度。";"CISunbeamsGenerator" = "产生阳光效果。您通常使用该阳光滤镜的输出作为合成滤镜的输入。";"CISwipeTransition" = "通过模拟挥击动作，来完成从一幅图像到另一幅图像的过渡。";"CITorusLensDistortion" = "创建圆环形状的镜头，并扭曲图像中有镜头置于其上的部分。";"CITriangleTile" = "将图像的三角形部分与一个三角形区域匹配，然后拼贴该结果。";"CITwelvefoldReflectedTile" = "应用 12 路反射对称从来源图像生成一个拼贴图案。";"CITwirlDistortion" = "旋转点周围的像素，以产生螺旋效果。您可以指定旋转的数目，以及指定效果的中心和半径。";"CIUnsharpMask" = "增加图像中不同颜色像素的边缘的对比度。";"CIVortexDistortion" = "旋转点周围的像素，以模拟漩涡。您可以指定旋转的数目，以及指定效果的中心和半径。";"CIWhitePointAdjust" = "为图像调整参考白点，然后使用新参考匹配来源中的所有颜色。";"CIZoomBlur" = "模拟捕捉图像时推拉照相机镜头的效果。";"CIColorBlendMode" = "将背景的亮度值与来源图像的色调及饱和度值一起使用。该模式在图像内保留灰色色阶。";"CIColorBurnBlendMode" = "将背景图像采样变暗，以反映来源图像采样。指定为白色的来源图像采样值不会产生改变。";"CIColorDodgeBlendMode" = "将背景图像采样变亮，以反映来源图像采样。指定为黑色的来源图像采样值不会产生变化。";"CIDarkenBlendMode" = "（从来源图像或背景）选取较暗的采样，以创建合成图像采样。结果是背景图像采样被任何更暗的来源图像采样替换掉。否则，背景图像采样保持不变。";"CIDifferenceBlendMode" = "从背景图像采样颜色中减去来源图像采样颜色，或反之，取决于哪个采样的亮度值更高。来源图像采样中的黑色值不引起任何更改；白色值将颠倒背景颜色值。";"CIExclusionBlendMode" = "生成类似于 CIDifferenceBlendMode 滤镜所产生的效果，但对比度较低。来源图像采样中的黑色值不引起任何更改；白色值将颠倒背景颜色值。";"CIHardLightBlendMode" = "乘以颜色或者掩蔽颜色，取决于来源图像的采样颜色。如果来源图像采样颜色比 50% 灰色更亮，则背景被变亮，类似于掩蔽。如果来源图像采样颜色比 50% 灰色更暗，则背景被变暗，类似于相乘。如果来源图像采样颜色与 50% 灰色相等，则来源图像不会更改。与纯黑或纯白相等的图像采样将导致纯黑或纯白。整体效果类似于您在来源图像上放置一个刺眼的聚光灯用于照明所能达成的效果。";"CIHueBlendMode" = "将背景的亮度和饱和度值与来源图像的色调一起使用。";"CILightenBlendMode" = "（从来源图像或背景）选取较亮的采样，以创建合成图像采样。结果是背景图像采样被任何更亮的来源图像采样替换掉。否则，背景图像采样保持不变。";"CILuminosityBlendMode" = "将背景的色调和饱和度值与来源图像的亮度一起使用。该模式创建一个效果，其效果与 CIColorBlendMode 滤镜所创建的效果相反。";"CIMultiplyBlendMode" = "将来源图像采样乘以背景图像采样。这样产生的结果颜色，将至少与两种起作用的采用颜色中较暗的那种颜色一样暗。";"CIOverlayBlendMode" = "将来源图像采样与背景图像采用相乘，或者用背景图像采样掩蔽来源图像采样，取决于背景颜色。结果是重叠已有图像采样，同时保留高亮显示和背景阴影。背景颜色与来源颜色混合，以反映背景的亮度或暗度。";"CISaturationBlendMode" = "将背景的亮度和色调值与来源图像的饱和度值一起使用。背景中无饱和度的区域（即纯灰区域）不会引起任何更改。";"CIScreenBlendMode" = "将来源图像采样的相反值与背景图像采样的相反值相乘。这样产生的结果颜色，将至少与两种起作用的采用颜色中较亮的那种颜色一样亮。";"CISoftLightBlendMode" = "变暗颜色或者加亮颜色，取决于来源图像的采样颜色。如果来源图像采样颜色比 50% 灰色更亮，则背景被变亮，类似于遮光。如果来源图像采样颜色比 50% 灰色更暗，则背景被变暗，类似于加深。如果来源图像采样颜色与 50% 灰色相等，则背景图像不会更改。与纯黑或纯白相等的图像采样将产生更暗或更亮的区域，但不会导致纯黑或纯白。整体效果类似于您在来源图像上放置一个漫射的聚光灯用于照明所能达成的效果。";"outputImage" = "滤镜产生的图像。";"inputBackgroundImage" = "用于背景图像的图像。";"inputImage" = "要用作输入图像的图像。对于也使用了背景图像的滤镜来说，这是前景图像。";"inputTime" = "效果的持续时间。";"inputTransform" = "要应用的变换。";"inputScale" = "效果值。";"inputAspectRatio" = "一个宽高比。";"inputCenter" = "要过滤的区域的中心（以 x 和 y 坐标标识）。";"inputRadius" = "离效果中心的距离。";"inputAngle" = "一个角度。";"inputRefraction" = "用在效果中的材料（比如玻璃）折射的索引。";"inputWidth" = "效果的宽度。";"inputSharpness" = "要应用的锐利化值。";"inputIntensity" = "效果的强度。";"inputEV" = "光圈值的数字，以使图像更亮或更暗。";"inputSaturation" = "用于调整饱和度的值。";"inputColor" = "一种颜色。";"inputBrightness" = "亮度级别。";"inputContrast" = "一个对比度级别。";"inputGradientImage" = "带 alpha 的环境贴图。该图像通常包含高亮显示和阴影。";"inputMaskImage" = "一幅蒙版图像。";"inputShadingImage" = "带 alpha 值的环境贴图。该图像通常包含高亮显示和阴影。";"inputTargetImage" = "用在过渡的目标图像。";"inputExtent" = "决定效果范围的矩形。";"CIBoxBlur.inputRadius" = "半径决定了使用多少像素来创建模糊化。半径越大，结果越模糊。";"CIDiscBlur.inputRadius" = "半径决定了使用多少像素来创建模糊化。半径越大，结果越模糊。";"CIGaussianBlur.inputRadius" = "半径决定了使用多少像素来创建模糊化。半径越大，结果越模糊。";"CIMotionBlur.inputRadius" ="半径决定了使用多少像素来创建模糊化。半径越大，结果越模糊。";"CIMotionBlur.inputAngle" = "动作的角度决定了模糊化要往哪个方向抹去。";"CINoiseReduction.inputNoiseLevel" = "杂点消除值。值越大，杂点消除得越多。";"CINoiseReduction.inputSharpness" = "最终图像的清晰度。值越大，结果越清晰。";"CIZoomBlur.inputCenter" = "要用作效果的中心的 x 和 y 位置。";"CIZoomBlur.inputAmount" = "缩放值。值越大，放大程度越大。";"CIColorControls.inputSaturation" = "要应用的饱和度值。值越大，结果的颜色越饱和。";"CIColorControls.inputBrightness" = "要应用的亮度值。值越大，结果越亮。";"CIColorControls.inputContrast" = "要应用的对比度值。值越大，结果图像的对比度越大。";"CIColorMatrix.inputRVector" = "用于乘以来源颜色值的红色值。";"CIColorMatrix.inputGVector" = "用于乘以来源颜色值的绿色值。";"CIColorMatrix.inputBVector" = "用于乘以来源颜色值的蓝色值。";"CIColorMatrix.inputAVector" = "用于乘以来源颜色值的 alpha 值。";"CIColorMatrix.inputBiasVector" = "添加到每个颜色成份的向量";"CIExposureAdjust.inputEV" = "用于调整图像曝光的值。值越大，曝光越亮。";"CIGammaAdjust.inputPower" = "用于改正图像亮度的灰度系数值。值越大，结果越暗。";"CIHueAdjust.inputAngle" = "用于改正图像色调的角度（以度为单位）。";"CIWhitePointAdjust.inputColor" = "用于白点的颜色。";"CIColorCube.inputDimension" = "颜色表的维数。";"CIColorCube.inputCubeData" = "这是一个使用预乘 alpha 的浮点 RGBA 单元格的颜色表。单元格以标准顺序排列。数据的列和行分别以红色和绿色来索引。每个数据平面后紧跟着下一个更高数据的平面，这些平面以蓝色作索引。";"CIColorMap.inputGradientImage" = "该图像的图像数据将变换来源图像值。";"CIColorMonochrome.inputColor" = "要应用到图像上的单色。";"CIColorMonochrome.inputIntensity" = "单色效果的强度。值 1.0 将使用提供的颜色创建一个单色图像。值 0.0 对图像不起效果。";"CIColorPosterize.inputLevels" = "用于每个颜色成份的亮度色阶数。较低值将导致更极端的海报效果。";"CIFalseColor.inputColor0" = "用于颜色斜面的第一种颜色。";"CIFalseColor.inputColor1" = "用于颜色斜面的第二种颜色。";"CISepiaTone.inputIntensity" = "棕褐色效果的强度。值 1.0 将创建单色棕褐色图像。值 0.0 对图像不起效果。";"CIBumpDistortion.inputCenter" = "要用作凹凸的中心的 x 和 y 位置。"; "CIBumpDistortion.inputRadius" = "半径决定了使用多少像素来创建扭曲。半径越大，扭曲的范围越广。"; "CIBumpDistortion.inputScale" = "效果的缩放比例决定了凹凸的曲率。值 0.0 没有效果。正数值创建一个向外的凸出；负数值创建一个向内的凹进。"; "CIBumpDistortionLinear.inputCenter" = "要用作扭曲的中心的 x 和 y 位置。"; "CIBumpDistortionLinear.inputRadius" = "半径决定了使用多少像素来创建扭曲。半径越大，扭曲的范围越广。";  "CIBumpDistortionLinear.inputScale" = "效果的缩放比例。"; "CIBumpDistortionLinear.inputAngle" = "扭曲发生点周围的线的角度（以度为单位）。"; "CICircleSplashDistortion.inputCenter" = "要用作扭曲的中心的 x 和 y 位置。";  "CICircleSplashDistortion.inputRadius" = "半径决定了使用多少像素来创建扭曲。半径越大，扭曲的范围越广。";  "CICircularWrap.inputCenter" = "要用作扭曲的中心的 x 和 y 位置。";  "CICircularWrap.inputRadius" = "半径决定了使用多少像素来创建扭曲。半径越大，扭曲的范围越广。";  "CICircularWrap.inputAngle" = "效果的角度。"; "CIDisplacementDistortion.inputDisplacementImage" = "其灰度值将应用到来源图像的图像。"; "CIDisplacementDistortion.inputScale" = "结果图像的纹理值。值越大，纹理越大。"; "CIGlassDistortion.inputTexture" = "要应用到来源图像上的一个纹理。";"CIGlassDistortion.inputCenter" = "要用作扭曲的中心的 x 和 y 位置。"; "CIGlassDistortion.inputScale" = "结果图像的纹理值。值越大，纹理越大。"; "CIGlassLozenge.inputPoint0" = "用于定义菱形一端的圆圈中心的 x 和 y 位置。"; "CIGlassLozenge.inputPoint1" = "用于定义菱形另一端的圆圈中心的 x 和 y 位置。";  "CIGlassLozenge.inputRadius" = "菱形的半径。半径越大，扭曲的范围越广。";  "CIGlassLozenge.inputRefraction" = "玻璃的折射。"; "CIHoleDistortion.inputCenter" = "要用作扭曲的中心的 x 和 y 位置。";  "CIHoleDistortion.inputRadius" = "半径决定了使用多少像素来创建扭曲。半径越大，扭曲的范围越广。";  "CIPinchDistortion.inputCenter" = "要用作扭曲的中心的 x 和 y 位置。"; "CIPinchDistortion.inputRadius" = "半径决定了使用多少像素来创建扭曲。半径越大，扭曲的范围越广。"; "CIPinchDistortion.inputScale" = "聚拢值。值 0.0 不起效果。值 1.0 是最强聚拢。";"CITorusLensDistortion.inputCenter" = "要用作圆环的中心的 x 和 y 位置。";  "CITorusLensDistortion.inputRadius" = "圆环的外半径。";  "CITorusLensDistortion.inputWidth" = "环的宽度。"; "CITorusLensDistortion.inputRefraction" = "玻璃的折射。"; "CITwirlDistortion.inputCenter" = "要用作扭曲的中心的 x 和 y 位置。";  "CITwirlDistortion.inputRadius" = "半径决定了使用多少像素来创建扭曲。半径越大，扭曲的范围越广。"; "CITwirlDistortion.inputAngle" = "螺旋的角度（以度为单位）。值可以是正数或负数。";"CIVortexDistortion.inputCenter" = "要用作扭曲的中心的 x 和 y 位置。"; "CIVortexDistortion.inputRadius" = "半径决定了使用多少像素来创建扭曲。半径越大，扭曲的范围越广。"; "CIVortexDistortion.inputAngle" = "漩涡的角度（以度为单位）。";"CICheckerboardGenerator.inputColor0" = "要用于第一套棋盘格方格的颜色。";"CICheckerboardGenerator.inputColor1" = "要用于第二套棋盘格方格的颜色。";"CICheckerboardGenerator.inputWidth" = "棋盘格图案中一个方格的宽度。";"CICheckerboardGenerator.inputSharpness" = "棋盘格图案的清晰度。值越小，图案越模糊。值范围从 0.0 到 1.0 不等。";"CIConstantColorGenerator.inputColor" = "要生成的颜色。"; "CILenticularHaloGenerator.inputCenter" = "要用作光环的中心的 x 和 y 位置。";"CILenticularHaloGenerator.inputHaloRadius" = "光环的半径。";"CILenticularHaloGenerator.inputHaloWidth" = "光环的宽度，从它的内部半径到它的外部半径。";"CILenticularHaloGenerator.inputOverlap" = "光环的衍射部分的重叠值。值 1.0 表示完全重叠；光环为白色。值 0.0 表示没有重叠；光环颜色无重叠。";"CILenticularHaloGenerator.inputStriationStrength" = "光环颜色的强度。值越大，强度越大。";"CILenticularHaloGenerator.inputStriationContrast" = "光环颜色的对比度。值越大，对比度越高。";"CIStarShineGenerator.inputCenter" = "要用作星形的中心的 x 和 y 位置。"; "CIStarShineGenerator.inputColor" = "用于圆形星的外壳的颜色。"; "CIStarShineGenerator.inputRadius" = "星形的半径。"; "CIStarShineGenerator.inputCrossScale" = "十字图案的大小。"; "CIStarShineGenerator.inputCrossAngle" = "十字图案的角度。"; "CIStarShineGenerator.inputCrossOpacity" = "十字图案的不透明度。"; "CIStarShineGenerator.inputCrossWidth" = "十字图案的宽度。"; "CIStarShineGenerator.inputEpsilon" = "十字钉的长度"; "CIStripesGenerator.inputCenter" = "要用作条纹图案的中心的 x 和 y 位置。"; "CIStripesGenerator.inputColor0" = "用于奇数条纹的颜色。"; "CIStripesGenerator.inputColor1" = "用于偶数条纹的颜色。";"CIStripesGenerator.inputWidth" = "条纹的宽度。"; "CIStripesGenerator.inputSharpness" = "条纹图案的清晰度。值越小，图案越模糊。值范围从 0.0 到 1.0 不等。"; "CISunbeamsGenerator.inputCenter" = "要用作阳光图案的中心的 x 和 y 位置。";"CISunbeamsGenerator.inputColor" = "阳光的颜色。";"CISunbeamsGenerator.inputSunRadius" = "阳光的半径。";"CISunbeamsGenerator.inputMaxStriationRadius" = "阳光的半径。";"CISunbeamsGenerator.inputStriationStrength" = "阳光的强度。值越高，强度越大。";"CISunbeamsGenerator.inputStriationContrast" = "阳光的对比度。值越高，对比度越高。";"CIAffineTransform.inputTransform" = "要应用到图像上的变换。"; "CICrop.inputRectangle" = "表明应用到图像的裁剪范围的矩形。"; "CILanczosScaleTransform.inputScale" = "用于图像的缩放系数。小于 1.0 的值将图像按比例缩小。大于 1.0 的值将图像按比例放大。"; "CILanczosScaleTransform.inputAspectRatio" = "图像的宽高比。"; "CIPerspectiveTransform.inputTopLeft" = "要映射图像的左上坐标。"; "CIPerspectiveTransform.inputTopRight" = "要映射图像的右上坐标。"; "CIPerspectiveTransform.inputBottomRight" = "要映射图像的右下坐标。"; "CIPerspectiveTransform.inputBottomLeft" = "要映射图像的左下坐标。"; "CIGaussianGradient.inputColor0" = "要在渐变中使用的第一种颜色。"; "CIGaussianGradient.inputColor1" = "要在渐变中使用的第二种颜色。"; "CIGaussianGradient.inputRadius" = "高斯分布的半径。"; "CILinearGradient.inputPoint0" = "渐变的开始位置，也就是第一种颜色开始的地方。"; "CILinearGradient.inputPoint1" = "渐变的结束位置，也就是第二种颜色开始的地方。"; "CILinearGradient.inputColor0" = "要在渐变中使用的第一种颜色。";  "CILinearGradient.inputColor1" = "要在渐变中使用的第二种颜色。";  "CIRadialGradient.inputRadius0" = "要在渐变中使用的开始圆的半径。";"CIRadialGradient.inputRadius1" = "要在渐变中使用的结束圆的半径。";"CIRadialGradient.inputColor0" = "要在渐变中使用的第一种颜色。";  "CIRadialGradient.inputColor1" = "要在渐变中使用的第二种颜色。"; "CICircularScreen.inputCenter" = "要用作圆形屏幕图案的中心的 x 和 y 位置。"; "CICircularScreen.inputWidth" = "图案内每个圆形之间的距离。"; "CICircularScreen.inputSharpness" = "圆形的清晰度。值越大，圆形越清晰。"; "CICMYKHalftone.inputCenter" = "要用作半色调图案的中心的 x 和 y 位置。";  "CICMYKHalftone.inputWidth" = "图案内点之间的距离。"; "CICMYKHalftone.inputAngle" = "图案的角度。"; "CICMYKHalftone.inputSharpness" = "图案的清晰度。值越大，图案越清晰。"; "CICMYKHalftone.inputGCR" = "灰分量替换值。值从 0.0（无）到 1.0 不等。"; "CICMYKHalftone.inputUCR" = "底色移除值。值从 0.0 到 1.0 不等。"; "CIDotScreen.inputCenter" = "要用作点屏幕图案的中心的 x 和 y 位置。";  "CIDotScreen.inputAngle" = "图案的角度。"; "CIDotScreen.inputWidth" = "图案内点之间的距离。"; "CIDotScreen.inputSharpness" = "图案的清晰度。值越大，图案越清晰。"; "CIHatchedScreen.inputCenter" = "要用作影线屏幕图案的中心的 x 和 y 位置。"; "CIHatchedScreen.inputAngle" = "图案的角度。";"CIHatchedScreen.inputWidth" = "图案内线之间的距离。"; "CIHatchedScreen.inputShaprness" = "图案的清晰度。值越大，图案越清晰。"; "CILineScreen.inputCenter" = "要用作线屏幕图案的中心的 x 和 y 位置。";  "CILineScreen.inputAngle" = "图案的角度。"; "CILineScreen.inputWidth" = "图案内线之间的距离。"; "CILineScreen.inputSharpness" = "图案的清晰度。值越大，图案越清晰。"; 	"CISharpenLuminance.inputSharpness" = "要应用的锐化值。值越大，越清晰。";"CIUnsharpMask.inputRadius" = "要应用非清晰蒙版的围绕一个指定像素的半径。半径越大，图像被影响得越多。";"CIUnsharpMask.inputIntensity" = "效果的强度。值越大，受影响区域的对比度越大。";"CIBlendWithMask.inputMaskImage" = "一个灰度蒙版。当遮罩值为 0.0 时，结果是背景。当蒙版值为 1.0 时，结果是图像。"; "CIBloom.inputRadius" = "半径决定了使用多少像素来创建效果。半径越大，效果越强。";"CIBloom.inputIntensity" = "效果的强度。值 0.0 表示不起效果。值 1.0 表示最强效果。"; "CICrystallize.inputRadius" = "半径决定了使用多少像素来创建效果。半径越大，结果水晶越大。"; "CIEdges.inputIntensity" = "边缘的强度。值越大，强度越高。"; "CIEdgeWork.inputRadius" = "边缘的厚度。值越大，边缘越厚。"; "CIGloom.inputRadius" = "半径决定了使用多少像素来创建效果。半径越大，效果越强。"; "CIGloom.inputIntensity" = "效果的强度。值 0.0 表示不起效果。值 1.0 表示最强效果。"; "CIHeightFieldFromMask.inputImage" = "蒙版的白色值决定了高度场内部的像素，黑色值决定了外部的像素。域值在蒙版内平滑和持续地变化，在蒙版边缘达到值 0。"; "CIHeightFieldFromMask.inputRadius" = "用于平滑过渡的离蒙版边缘的距离与输入半径成比例。值越大，过渡越平滑和显著。值越小，过渡越接近于圆角半径。"; "CIHexagonalPixellate.inputCenter" = "要用作效果的中心的 x 和 y 位置。"; "CIHexagonalPixellate.inputScale" = "比例值决定了六边形的大小。值越大，六边形越大。"; "CILineOverlay.inputNRNoiseLevel" = "在追踪图像边缘之前被移除的图像的噪声大小（与照相机数据一起使用的）。增加噪声大小，有助于整理图像的追踪的边缘。"; "CILineOverlay.inputNRSharpness" = "在追踪图像边缘之前、移除图像杂点时完成的锐化数量。这增强了边缘收集。"; "CILineOverlay.inputEdgeIntensity" = "这是追踪图像边缘时 Sobel 梯度信息的加重系数。值越大，找到的边缘就越多，虽然通常使用较低的值（比如 1.0）。"; "CILineOverlay.inputThreshold" = "该值决定了边缘的可见度。值越大，边缘越稀薄。"; "CILineOverlay.inputContrast" = "用于该滤镜所产生的边缘的反锯齿值。值越大，产生的边缘的对比度越高（它们的反锯齿度较低）。"; "CIPixellate.inputCenter" = "要用作效果的中心的 x 和 y 位置。";  "CIPixellate.inputScale" = "比例值决定了正方形的大小。值越大，正方形越大。"; "CIPointillize.inputRadius" = "结果图案内圆圈的半径。"; "CIPointillize.inputCenter" = "要用作效果的中心的 x 和 y 位置。";  "CIShadedMaterial.inputShadingImage" = "用于高度场的图像。结果图像的高度值较大则阴影较亮，高度值较小（区域较低）则阴影较暗。"; "CIShadedMaterial.inputScale" = "效果的数值范围。值越大，效果越生动。"; "CISpotColor.inputCenterColor1" = "要替换的第一种颜色范围的中心值。"; "CISpotColor.inputReplacementColor1" = "用于第一种颜色范围的替换颜色。"; "CISpotColor.inputCloseness1" = "一个数值，用于指示在第一种颜色被替换前它的匹配度必须多接近。"; "CISpotColor.inputContrast1" = "第一种替换颜色的对比度。"; "CISpotColor.inputCenterColor2" = "要替换的第二种颜色范围的中心值。"; "CISpotColor.inputReplacementColor2" = "用于第二种颜色范围的替换颜色。";"CISpotColor.inputCloseness2" = "一个数值，用于指示在第二种颜色被替换前它的匹配度必须多接近。"; "CISpotColor.inputContrast2" = "第二种替换颜色的对比度。"; "CISpotColor.inputCenterColor3" = "要替换的第三种颜色范围的中心值。";  "CISpotColor.inputReplacementColor3" = "用于第三种颜色范围的替换颜色。"; "CISpotColor.inputCloseness3" = "一个数值，用于指示在第三种颜色被替换前它的匹配度必须多接近。";  "CISpotColor.inputContrast3" = "第三种替换颜色的对比度。";  "CISpotLight.inputLightPosition" = "聚光灯的 x 和 y 位置。"; 		"CISpotLight.inputLightPointsAt" = "聚光灯指向的 x 和 y 位置。";  "CISpotLight.inputBrightness" = "聚光灯的亮度。"; "CISpotLight.inputConcentration" = "聚光灯的大小。值越小，光速聚焦得越窄。"; "CISpotLight.inputColor" = "聚光灯的颜色。"; "CIAffineClamp.inputTransform" = "要应用到图像上的变换。"; "CIAffineTile.inputTransform" = "要应用到图像上的变换。"; "CIEightfoldReflectedTile.inputCenter" = "要用作效果的中心的 x 和 y 位置。";  "CIEightfoldReflectedTile.inputAngle" = "拼贴图案的角度（以度为单位）。"; "CIEightfoldReflectedTile.inputWidth" = "拼贴的宽度。"; "CIFourfoldReflectedTile.inputCenter" = "要用作效果的中心的 x 和 y 位置。";  "CIFourfoldReflectedTile.inputAngle" = "拼贴图案的角度（以度为单位）。";  "CIFourfoldReflectedTile.inputAcuteAngle" = "重复的反射拼贴的主角度。小的值创建窄菱形拼贴，大的值创建宽反射拼贴。"; "CIFourfoldReflectedTile.inputWidth" = "拼贴的宽度。";  "CIFourfoldRotatedTile.inputCenter" = "要用作效果的中心的 x 和 y 位置。";  "CIFourfoldRotatedTile.inputAngle" = "拼贴图案的角度（以度为单位）。";  "CIFourfoldRotatedTile.inputWidth" = "拼贴的宽度。"; "CIFourfoldTranslatedTile.inputCenter" = "要用作效果的中心的 x 和 y 位置。";  "CIFourfoldTranslatedTile.inputAngle" = "拼贴图案的角度（以度为单位）。";  "CIFourfoldTranslatedTile.inputAcuteAngle" = "重复的转化拼贴的主角度。小的值创建窄菱形拼贴，大的值创建宽转化拼贴。"; "CIFourfoldTranslatedTile.inputWidth" = "拼贴的宽度。";  "CIGlideReflectedTile.inputCenter" = "要用作效果的中心的 x 和 y 位置。";  "CIGlideReflectedTile.inputAngle" = "拼贴图案的角度（以度为单位）。";  "CIGlideReflectedTile.inputWidth" = "拼贴的宽度。";  "CIKaleidoscope.inputCount" = "图案内倒影的数量。"; "CIKaleidoscope.inputCenter" = "要用作效果的中心的 x 和 y 位置。";  "CIKaleidoscope.inputAngle" = "倒影的角度。"; "CIOpTile.inputCenter" = "要用作效果的中心的 x 和 y 位置。";  "CIOpTile.inputScale" = "比例决定了效果中拼贴的数量。"; "CIOpTile.inputAngle" = "拼贴的角度。"; "CIOpTile.inputWidth" = "拼贴的宽度。"; "CIParallelogramTile.inputCenter" = "要用作效果的中心的 x 和 y 位置。"; "CIParallelogramTile.inputAngle" = "拼贴图案的角度（以度为单位）。";  "CIParallelogramTile.inputAcuteAngle" = "重复的平行四边形拼贴的主角度。小的值创建窄菱形拼贴，大的值创建宽平行四边形拼贴。"; "CIParallelogramTile.inputWidth" = "拼贴的宽度。";  "CIPerspectiveTile.inputTopLeft" = "拼贴左上的坐标。"; "CIPerspectiveTile.inputTopRight" = "拼贴右上的坐标。";"CIPerspectiveTile.inputBottomRight" = "拼贴右下的坐标。"; "CIPerspectiveTile.inputBottomLeft" = "拼贴左下的坐标。"; "CISixfoldReflectedTile.inputCenter" = "要用作效果的中心的 x 和 y 位置。";  "CISixfoldReflectedTile.inputAngle" = "拼贴图案的角度（以度为单位）。";  "CISixfoldReflectedTile.inputWidth" = "拼贴的宽度。"; "CISixfoldRotatedTile.inputCenter" = "要用作效果的中心的 x 和 y 位置。"; "CISixfoldRotatedTile.inputAngle" = "拼贴图案的角度（以度为单位）。";  "CISixfoldRotatedTile.inputWidth" = "拼贴的宽度。";  "CITriangleTile.inputCenter" = "要用作效果的中心的 x 和 y 位置。";  "CITriangleTile.inputAngle" = "拼贴图案的角度（以度为单位）。";  "CITriangleTile.inputWidth" = "拼贴的宽度。";  "CITwelvefoldReflectedTile.inputCenter" = "要用作效果的中心的 x 和 y 位置。"; "CITwelvefoldReflectedTile.inputAngle" = "拼贴图案的角度（以度为单位）。";"CITwelvefoldReflectedTile.inputWidth" = "拼贴的宽度。"; "CIBarsSwipeTransition.inputAngle" = "栏的角度（以度为单位）。";	"CIBarsSwipeTransition.inputWidth" = "每个栏的宽度。";	"CIBarsSwipeTransition.inputBarOffset" = "一个栏相对于另一个栏的偏移";	"CIBarsSwipeTransition.inputTime" = "过渡的参数时间。该值从头（在时间 0）到尾（在时间 1）驱动过渡。";"CICopyMachineTransition.inputColor" = "复印机灯光的颜色。";"CICopyMachineTransition.inputAngle" = "复印机灯光的角度。";"CICopyMachineTransition.inputWidth" = "复印机灯光的宽度。";"CICopyMachineTransition.inputOpacity" = "复印机灯光的不透明度。值 0.0 表示透明。值 1.0 表示不透明。";"CICopyMachineTransition.inputTime" = "过渡的参数时间。该值从头（在时间 0）到尾（在时间 1）驱动过渡。";"CIDisintegrateWithMaskTransition.inputMaskImage" = "用于定义从来源分裂到目标图像时的形状的图像。";"CIDisintegrateWithMaskTransition.inputShadowRadius" = "蒙版创建的阴影的半径。";"CIDisintegrateWithMaskTransition.inputShadowDensity" = "蒙版创建的阴影的密度。";"CIDisintegrateWithMaskTransition.inputShadowOffset" = "蒙版创建的阴影的偏移。";"CIDisintegrateWithMaskTransition.inputTime" = "过渡的参数时间。该值从头（在时间 0）到尾（在时间 1）驱动过渡。";"CIDissolveTransition.inputTime" = "过渡的参数时间。该值从头（在时间 0）到尾（在时间 1）驱动过渡。";"CIFlashTransition.inputCenter" = "要用作效果的中心的 x 和 y 位置。"; "CIFlashTransition.inputExtent" = "闪光灯的范围。";"CIFlashTransition.inputColor" = "从闪光灯散发出的光线的颜色。";"CIFlashTransition.inputMaxStriationRadius" = "从闪光灯散发出的光线的有效射程。";"CIFlashTransition.inputStriationStrength" = "从闪光灯散发出的光线的强度。";"CIFlashTransition.inputStriationContrast" = "从闪光灯散发出的光线的对比度。";"CIFlashTransition.inputFadeThreshold" = "从闪光灯到目标图像的衰减值。值越高，闪光时间越多，衰减时间越少。";"CIFlashTransition.inputTime" = "过渡的参数时间。该值从头（在时间 0）到尾（在时间 1）驱动过渡。";"CIModTransition.inputCenter" = "要用作效果的中心的 x 和 y 位置。"; "CIModTransition.inputAngle" = "凹洞图案的角度。";"CIModTransition.inputRadius" = "图案内未扭曲的孔洞的半径。";"CIModTransition.inputCompression" = "应用到凹洞图案的拉伸值。位于中心的孔洞的扭曲程度，不如图像边缘的孔洞的扭曲程度大。";"CIModTransition.inputTime" = "过渡的参数时间。该值从头（在时间 0）到尾（在时间 1）驱动过渡。";"CIPageCurlTransition.inputBacksideImage" = "出现在来源图像背面的图像，同时页面卷曲以显示目标图像。";"CIPageCurlTransition.inputShadingImage" = "围绕在方形图像内的类似着色球体的图像。";"CIPageCurlTransition.inputExtent" = "效果的范围。";"CIPageCurlTransition.inputAngle" = "卷曲页面的角度。";"CIPageCurlTransition.inputRadius" = "卷曲的半径。";"CIPageCurlTransition.inputTime" = "过渡的参数时间。该值从头（在时间 0）到尾（在时间 1）驱动过渡。";"CIRippleTransition.inputShadingImage" = "围绕在方形图像内的类似着色球体的图像。";"CIRippleTransition.inputCenter" = "要用作效果的中心的 x 和 y 位置。"; "CIRippleTransition.inputExent" = "效果的范围。";"CIRippleTransition.inputWidth" = "波纹的宽度。";"CIRippleTransition.inputScale" = "一个数值，用于决定波纹开始时呈凸起状（较高值）或涟漪状（较低值）。";"CIRippleTransition.inputTime" = "过渡的参数时间。该值从头（在时间 0）到尾（在时间 1）驱动过渡。";"CISwipeTransition.inputExtent" = "效果的范围。";"CISwipeTransition.inputColor" = "挥击的颜色";"CISwipeTransition.inputAngle" = "挥击的角度";"CISwipeTransition.inputWidth" = "挥击的宽度";"CISwipeTransition.inputOpacity" = "挥击的不透明度。";"CISwipeTransition.inputTime" = "过渡的参数时间。该值从头（在时间 0）到尾（在时间 1）驱动过渡。";"CIAreaHistogram" = "计算图像中指定区域的直方图，将结果以一维图像返回。";"CIAreaHistogram.inputExtent" = "矩形指定了您要处理的图像的子区域。";"CIAreaHistogram.inputCount" = "直方图中的媒体夹数。";"CIAreaHistogram.inputImage" = "您要计算的直方图所在的图像";"CIAreaHistogram.inputScale" = "用于直方图值的缩放值。";"CIAreaMaximum" = "计算图像中指定区域的最大分量值，将结果以像素返回。";"CIAreaMaximum.inputExtent" = "矩形指定了您要处理的图像的子区域。";"CIAreaMaximum.inputImage" = "要处理的图像";"CIAreaMinimum" = "计算图像中指定区域的最小分量值，将结果以像素返回。";"CIAreaMinimum.inputExtent" = "矩形指定了您要处理的图像的子区域。";"CIAreaMinimum.inputImage" = "要处理的图像";"CIAreaMaximumAlpha" = "查找并以最大 alpha 值返回像素。";"CIAreaMaximumAlpha.inputExtent" = "矩形指定了您要处理的图像的子区域。";"CIAreaMaximumAlpha.inputImage" = "要处理的图像";"CIAreaMinimumAlpha" = "查找并以最小 alpha 值返回像素。";"CIAreaMinimumAlpha.inputExtent" = "矩形指定了您要处理的图像的子区域。";"CIAreaMinimumAlpha.inputImage" = "要处理的图像";"CIAreaAverage" = "计算图像中指定区域的平均颜色，将结果以像素返回。";"CIAreaAverage.inputExtent" = "矩形指定了您要处理的图像的子区域。";"CIAreaAverage.inputImage" = "要处理的图像";"CIRowAverage" = "计算图像中指定区域的每行的平均颜色，将结果以一维图像返回。";"CIRowAverage.inputExtent" = "矩形指定了您要处理的图像的子区域。";"CIRowAverage.inputImage" = "要处理的图像";"CIColumnAverage" = "计算图像中指定区域的每列的平均颜色，将结果以一维图像返回。";"CIColumnAverage.inputExtent" = "矩形指定了您要处理的图像的子区域。";"CIColumnAverage.inputImage" = "要处理的图像";"CIMinimumComponent" = "使用三种颜色分量中最小者来将图像转换成灰度。";"CIMinimumComponent.inputExtent" = "矩形指定了您要处理的图像的子区域。";"CIMinimumComponent.inputImage" = "要处理的图像";"CIMaximumComponent" = "使用三种颜色分量中最大者来将图像转换成灰度。";"CIMaximumComponent.inputExtent" = "矩形指定了您要处理的图像的子区域。";"CIMaximumComponent.inputImage" = "要处理的图像";